Repository: nc-photos/nc-photos
Catalog: app/lib/l10n/app_*.arb
Languages: fi

# fileLastSharedDescription
source: Last shared on {date}
fi: Jaettu viimeksi {date}

# fileLastSharedByOthersDescription
source: {user} shared with you on {date}
fi: {user} jakoi kanssasi {date}

# albumLastSharedByOthersDescription
source: {user} shared an album with you on {date}
fi: {user} jakoi albumin kanssasi {date}

# sharedWithLabel
source: Shared with
fi: Jaettu

# unshareTooltip
source: Unshare
fi: Poista jako

# unshareSuccessNotification
source: Removed share
fi: Poistetut jaot

# locationLabel
source: Location
fi: Sijainti

# multipleFilesLinkShareDialogContent
source: Nextcloud does not support share link for multiple files. The app will instead COPY the files to a new folder and share the folder instead.
fi: Nextcloud ei tue linkin jakoa usealle tiedostolle. Sovellus KOPIO sen sijaan tiedostot kansioon ja jakaa luodun kansion.

# folderNameInputHint
source: Folder name
fi: Kansion nimi

# folderNameInputInvalidEmpty
source: Please enter the name of the folder
fi: Syötä kansion nimi

# folderNameInputInvalidCharacters
source: Contains invalid characters
fi: Sisältää sopimattomia merkkejä

# createShareProgressText
source: Creating share
fi: Luodaan jakoa

# copyItemsFailureNotification
source: {count, plural, =1{Failed copying 1 item} other{Failed copying {count} items}}
fi: {count, plural, =1{ 1 kohteen kopiointi epäonnistui} other{{count} kohteen kopiointi epäonnistui}}

# unshareLinkShareDirDialogTitle
source: Delete folder?
fi: Poista kansio?

# unshareLinkShareDirDialogContent
source: This folder was created by the app to share multiple files as a link. It is now no longer shared with any party, do you want to delete this folder?
fi: Sovellus loi tämän kansion jakaakseen useamman tiedoston samalla linkillä. Sitä ei enää jaeta kenenkään kanssa. Haluatko poistaa tämän kansion?

# addToCollectionTooltip
source: Add to collection
fi: Lisää kokoelmaan

# addToCollectionProcessingNotification
source: Adding {album} to your collection
fi: Lisätään {album} kokoelmaasi

# addToCollectionSuccessNotification
source: Added {album} to your collection successfully
fi: {album} lisätty kokoelmaasi

# shareAlbumDialogTitle
source: Share with user
fi: Jaa toisen käyttäjän kanssa

# shareAlbumSuccessNotification
source: Album shared with {user}
fi: Albumi jaettu käyttäjän {user} kanssa

# shareAlbumSuccessWithErrorNotification
source: Album shared with {user}, but failed to share some files
fi: Albumi jaettu käyttäjän {user} kanssa. Joidenkin tiedostojen jako kuitenkin epäonnistui

# unshareAlbumSuccessNotification
source: Album unshared with {user}
fi: Albumin jakaminen käyttäjän kanssa {user} lopetettu

# unshareAlbumSuccessWithErrorNotification
source: Album unshared with {user}, but failed to unshare some files
fi: Albumin jakaminen käyttäjän {user} kanssa lopetettu. Joidenkin tiedostojen jakaminen kuitenkin epäonnistui

# fixSharesTooltip
source: Fix shares
fi: Korjaa jaot

# fixTooltip
source: Fix
fi: Korjaa

# fixButtonLabel
source: FIX
fi: KORJAA

# fixAllTooltip
source: Fix all
fi: Korjaa kaikki

# missingShareDescription
source: Not shared with {user}
fi: Ei jaettu käyttäjäm {user} kanssa

# extraShareDescription
source: Shared with {user}
fi: Jaettu käyttäjän {user} kanssa

# defaultButtonLabel
source: DEFAULT
fi: OLETUS

# addUserInputHint
source: Add user
fi: Lisää käyttäjä

# sharedAlbumInfoDialogTitle
source: Introducing shared album
fi: Uutena ominaisuutena jaetut albumit

# sharedAlbumInfoDialogContent
source: Shared album allows multiple users on the same server to access the same album. Please read carefully the limitations before continuing
fi: Jaetut albumit sallii useiden käyttäjien yhtäaikaisen pääsyn albumiin. Lue huolellisesti jaettujen albumien rajoitukset ennen käyttöä

# learnMoreButtonLabel
source: LEARN MORE
fi: LUE LISÄÄ

# migrateDatabaseProcessingNotification
source: Updating database
fi: Päivitetään tietokantaa

# migrateDatabaseFailureNotification
source: Failed migrating database
fi: Tietokantojen yhdistäminen epäonnistui

# memoryAlbumName
source: {count, plural, =1{1 year ago} other{{count} years ago}}
fi: {count, plural, =1{1 vuosi sitten} other{{count} vuotta sitten}}

# homeFolderNotFoundDialogTitle
source: Home folder not found
fi: Kotikansiota ei löytynyt

# homeFolderNotFoundDialogContent
source: Please correct the WebDAV URL shown below. You can find the URL in the Nextcloud web interface.
fi: Korjaa WebDAV URL-osoite. Löydät URL-osoitteen Nextloud-verkkokäyttöliittymästä.

# homeFolderInputInvalidEmpty
source: Please enter the name of your home folder
fi: Nimeä kotikansiosi

# createCollectionTooltip
source: New collection
fi: Uusi kokoelma

# createCollectionDialogAlbumLabel
source: Album
fi: Albumi

# createCollectionDialogAlbumDescription
source: Show photos added by you from anywhere on the server
fi: Näytä kaikki palvelimelle lisäämäsi kuvat

# createCollectionDialogFolderLabel
source: Folder
fi: Kansio

# createCollectionDialogFolderDescription
source: Show photos inside a folder
fi: Näytä kaikki kansion kuvat

# convertAlbumTooltip
source: Convert to album
fi: Muuta albumiksi

# convertAlbumConfirmationDialogContent
source: This conversion is nonreversible
fi: Muutosta ei voi perua

# convertAlbumSuccessNotification
source: Converted collection to album successfully
fi: Kokoelman muutos albumiksi onnistui

# collectionFavoritesLabel
source: Favorites
fi: Suosikit

# favoriteTooltip
source: Favorite
fi: Suosikki

# favoriteSuccessNotification
source: Added to favorites
fi: Lisää suosikkeihin

# favoriteFailureNotification
source: Failed adding to favorites
fi: Kuvien lisäys suosikkeihin epäonnistui

# unfavoriteTooltip
source: Unfavorite
fi: Poista suosikeista

# unfavoriteSuccessNotification
source: Removed from favorites
fi: Poistettu suosikeista

# unfavoriteFailureNotification
source: Failed removing from favorites
fi: Suosikeista poisto epäonnistui

# createCollectionDialogTagLabel
source: Tag
fi: Tunniste

# createCollectionDialogTagDescription
source: Show photos with specific tags
fi: Näytä kuvat tietyillä tunnisteilla

# addTagInputHint
source: Add tag
fi: Lisää tunniste

# tagPickerNoTagSelectedNotification
source: Please add at least 1 tag
fi: Lisää ainakin yksi tunniste

# backgroundServiceStopping
source: Stopping service
fi: Pysäytetään palvelua

# metadataTaskPauseLowBatteryNotification
source: Battery is low
fi: Akku on vähissä

# enhanceTooltip
source: Enhance
fi: Paranna

# enhanceButtonLabel
source: ENHANCE
fi: PARANNA

# enhanceIntroDialogTitle
source: Enhance your photos
fi: Paranna kuviasi

# enhanceIntroDialogDescription
source: Your photos are processed locally on your device. By default, they are downscaled to 2048x1536. You can adjust the output resolution in Settings
fi: Kuviasi käsitellään paikallisesti laitteellasi. Oletuksena kuvat skaalataan resoluutioon 2048x1536. Voit muuttaa tämän resoluution asetuksista.

# enhanceLowLightTitle
source: Low-light enhancement
fi: Hämärässä otettujen kuvien parannus

# enhanceLowLightDescription
source: Brighten your photos taken in low-light environments
fi: Kirkasta hämärässä ympäristössä otettuja kuvia

# enhanceLowLightParamBrightnessLabel
source: Brightness
fi: Kirkkaus

# collectionEditedPhotosLabel
source: Edited (local)
fi: Muokatut (paikallinen)

# deletePermanentlyLocalConfirmationDialogContent
source: Selected items will be deleted permanently from this device. This action is nonreversible
fi: Valitut kuvat poistetaan lopullisesti laitteeltasi. Tätä toimintoa ei voi perua.

# enhancePortraitBlurTitle
source: Portrait blur
fi: Muotokuvan sumennus

# enhancePortraitBlurDescription
source: Blur the background of your photos, work best with portraits
fi: Sumenna kuviesi taustaa, toimii parhaiten muotokuvien kanssa

# enhanceSuperResolution4xTitle
source: Super-resolution (4x)
fi: Super-resoluutio (4x)

# enhanceSuperResolution4xDescription
source: Enlarge your photos to 4x of its original resolution (see Help for details on how max resolution applies here)
fi: Skaalaa kuviesi resoluutiota jopa 4x normaalista resoluutiosta. (Lue kohta Apua saadaksesi lisätietoa, kuinka toiminto toimii.)

# enhanceStyleTransferTitle
source: Style transfer
fi: Tyylin siirto

# enhanceStyleTransferStyleDialogTitle
source: Pick a style
fi: Valitse tyyli

# enhanceStyleTransferStyleDialogDescription
source: Transfer image style from a reference image to your photos
fi: Siirrä kuvan tyyli vertailukuvasta omiin kuviisi.

# enhanceStyleTransferNoStyleSelectedNotification
source: Please pick a style
fi: Valitse tyyli

# enhanceColorPopTitle
source: Color pop
fi: Värihyppy

# enhanceColorPopDescription
source: Desaturate the background of your photos, work best with portraits
fi: Vähennä kuvien taustan saturaatiota, toimii parhaiten muotokuvien kanssa.

# enhanceGenericParamWeightLabel
source: Weight
fi: Paino

# enhanceRetouchTitle
source: Auto retouch
fi: Automaattinen parannus

# enhanceRetouchDescription
source: Automatically retouch your photos, improve overall color and vibrance
fi: Paranna kuvia automaattisesti. Parantaa kuvien värisävyjä.

# doubleTapExitNotification
source: Tap again to exit
fi: Napauta uudelleen poistuaksesi

# imageEditDiscardDialogTitle
source: Discard changes?
fi: Hylkää muutokset?

# imageEditDiscardDialogContent
source: Your changes are not saved
fi: Muutoksia ei tallennettu

# discardButtonLabel
source: DISCARD
fi: HYLKÄÄ

# imageEditColorBrightness
source: Brightness
fi: Kirkkaus

# imageEditColorContrast
source: Contrast
fi: Kontrasti

# imageEditColorWhitePoint
source: White point
fi: Valkoinen piste

# imageEditColorBlackPoint
source: Black point
fi: Musta piste

# imageEditColorSaturation
source: Saturation
fi: Saturaatio

# imageEditColorWarmth
source: Warmth
fi: Lämpö

# imageEditColorTint
source: Tint
fi: Värisävy

# imageEditTitle
source: Preview edits
fi: Esikatsele muutoksia

# imageEditToolbarColorLabel
source: Color
fi: Väri

# imageEditToolbarTransformLabel
source: Transform
fi: Muuta

# imageEditTransformOrientation
source: Orientation
fi: Kierto

# imageEditTransformOrientationClockwise
source: cw
fi: myötäpäivään

# imageEditTransformOrientationCounterclockwise
source: ccw
fi: vastapäivään

# imageEditTransformCrop
source: Crop
fi: Rajaa

# categoriesLabel
source: Categories
fi: Luokat

# searchLandingPeopleListEmptyText
source: Press help to learn how to setup
fi: Paina kysymys-painiketta saadaksesi tietoa ominaisuuden asentamisesta

# searchLandingCategoryVideosLabel
source: Videos
fi: Videot

# searchFilterButtonLabel
source: FILTERS
fi: SUODATTIMET

# searchFilterDialogTitle
source: Search filters
fi: Hakusuodattimet

# applyButtonLabel
source: APPLY
fi: KÄYTÄ

# searchFilterOptionAnyLabel
source: Any
fi: Kaikki

# searchFilterOptionTrueLabel
source: True
fi: Tosi

# searchFilterOptionFalseLabel
source: False
fi: Epätosi

# searchFilterTypeLabel
source: Type
fi: Tyyppi

# searchFilterTypeOptionImageLabel
source: Image
fi: Kuva

# searchFilterBubbleTypeImageText
source: images
fi: kuvat

# searchFilterBubbleTypeVideoText
source: videos
fi: videot

# searchFilterFavoriteLabel
source: Favorite
fi: Suosikki

# searchFilterBubbleFavoriteTrueText
source: favorites
fi: suosikit

# searchFilterBubbleFavoriteFalseText
source: not favorites
fi: ei suosikeissa

# showAllButtonLabel
source: SHOW ALL
fi: NÄYTÄ KAIKKI

# gpsPlaceText
source: Near {place}
fi: Seuraava {place}

# gpsPlaceAboutDialogTitle
source: About place
fi: Paikasta

# gpsPlaceAboutDialogContent
source: The place shown here is only a rough estimation and not guaranteed to be accurate. It does not represent our views on any disputed areas.
fi: Näytetty paikka on vain karkea arvio. Se ei välttämättä ole tarkka. Paikka ei kuvaa sovelluksen kehittäjien näkökantaa alueesta.

# collectionPlacesLabel
source: Places
fi: Paikat

# imageSaveOptionDialogTitle
source: Saving the result
fi: Tallennetaan tulosta

# imageSaveOptionDialogContent
source: Select where to save this and future processed images. If you picked server but the app failed to upload it, it will be saved on your device.
fi: Valitse mihin prosessoidut kuvat tallennetaan. Mikäli kuvansiirto palvelimelle epäonnistuu, tallennetaan kuva laitteelle.

# imageSaveOptionDialogDeviceButtonLabel
source: DEVICE
fi: LAITE

# imageSaveOptionDialogServerButtonLabel
source: SERVER
fi: PALVELIN

# errorUnauthenticated
source: Unauthenticated access. Please sign-in again if the problem continues
fi: Ei sallittu pääsyä. Kirjaudu sovellukseen uudelleen mikäli virhe toistuu

# errorDisconnected
source: Unable to connect. Server may be offline or your device may be disconnected
fi: Yhdistäminen epäonnistui. Palvelin saattaa olla offline-tilassa tai mobiililaitettasi ei ole kytketty verkkoon

# errorLocked
source: File is locked on server. Please try again later
fi: Tiedosto lukittu palvelimella. Yritä myöhemmin uudelleen

# errorInvalidBaseUrl
source: Unable to communicate. Please make sure the address is the base URL of your Nextcloud instance
fi: Yhteyttä ei voitu muodostaa. Varmista, että Nextcloud-palvelimesi URL-osoite on oikein

# errorWrongPassword
source: Unable to authenticate. Please double check the username and password
fi: Kirjautuminen epäonnistui. Varmista, että käyttäjätunnuksesi ja salasanasi on oikein

# errorServerError
source: Server error. Please make sure the server is setup correctly
fi: Palvelin-virhe. Varmista, että palvelin on konfiguroitu oikein

# errorAlbumDowngrade
source: Can't modify this album as it was created by a later version of this app. Please update the app and try again
fi: Albumia ei voitu muokata, koska albumi on luotu sovelluksen uudemmalla versiolla. Päivitä sovellus viimeisimpään versioon ja yritä uudelleen

# errorNoStoragePermission
source: Require storage access permission
fi: Tallennustilan käyttölupa vaaditaan
