Repository: nc-photos/nc-photos
Catalog: app/lib/l10n/app_*.arb
Languages: fi

# photosTabLabel
source: Photos
fi: Kuvat

# collectionsTooltip
source: Collections
fi: Kokoelmat

# zoomTooltip
source: Zoom
fi: Tarkenna

# refreshMenuLabel
source: Refresh
fi: Päivitä

# settingsMenuLabel
source: Settings
fi: Asetukset

# selectionAppBarTitle
source: {count, plural, other{{count} selected}}
fi: {count, plural, other{{count} valittu}}

# addSelectedToAlbumSuccessNotification
source: All items added to {album} successfully
fi: Kaikki kohteet lisätty albumiin {album}

# addSelectedToAlbumFailureNotification
source: Failed adding items to album
fi: Kohteiden lisääminen albumiin epäonnistui

# addToAlbumTooltip
source: Add to album
fi: Lisää albumiin

# addToAlbumSuccessNotification
source: Added to {album} successfully
fi: Lisätty albumiini {album}

# addToAlbumFailureNotification
source: Failed adding to album
fi: Albumiin lisääminen epäonnistui

# deleteSelectedProcessingNotification
source: {count, plural, =1{Deleting 1 item} other{Deleting {count} items}}
fi: {count, plural, =1{Poistetaan 1 kohde} other{Poistetaan {count} kohdetta}}

# deleteSelectedSuccessNotification
source: All items deleted successfully
fi: Kaikki valitut kohteet poistettu onnistuneesti

# deleteSelectedFailureNotification
source: {count, plural, =1{Failed deleting 1 item} other{Failed deleting {count} items}}
fi: {count, plural, =1{ 1 kohteen poistaminen epäonnistui} other{{count} kohteen poistaminen epäonnistui}}

# archiveTooltip
source: Archive
fi: Arkistoi

# archiveSelectedProcessingNotification
source: {count, plural, =1{Archiving 1 item} other{Archiving {count} items}}
fi: {count, plural, =1{Arkistoi 1 kohdetta} other{Arkistoi {count} kohdetta}}

# archiveSelectedSuccessNotification
source: All items archived successfully
fi: Kaikki valitut kohteet arkistoitu

# archiveSelectedFailureNotification
source: {count, plural, =1{Failed archiving 1 item} other{Failed archiving {count} items}}
fi: {count, plural, =1{1 kohteen arkistointi epäonnistui} other{{count} kohteen arkistointi epäonnistui}}

# unarchiveTooltip
source: Unarchive
fi: Peru arkistointi

# unarchiveSelectedProcessingNotification
source: {count, plural, =1{Unarchiving 1 item} other{Unarchiving {count} items}}
fi: {count, plural, =1{ 1 kohteen arkistointia perutaan} other{{count} kohteen arkistointia perutaan}}

# unarchiveSelectedSuccessNotification
source: All items unarchived successfully
fi: Kaikkien kohteiden arkistointi peruttu

# unarchiveSelectedFailureNotification
source: {count, plural, =1{Failed unarchiving 1 item} other{Failed unarchiving {count} items}}
fi: {count, plural, =1{1 kohteen arkistoinnin peruminen epäonnistui} other{{count} kohteen arkistoinnin peruminen epäonnistui}}

# deleteTooltip
source: Delete
fi: Poista

# deleteProcessingNotification
source: Deleting item
fi: Poistetaan kohdetta

# deleteSuccessNotification
source: Deleted item successfully
fi: Kohde poistettu

# deleteFailureNotification
source: Failed deleting item
fi: Kohteen poistaminen epäonnistui

# removeSelectedFromAlbumTooltip
source: Remove selected from album
fi: Poista valitut albumista

# removeSelectedFromAlbumSuccessNotification
source: {count, plural, =1{1 item removed from album} other{{count} items removed from album}}
fi: {count, plural, =1{1 kohde poistettu albumista} other{{count} kohdetta poistettu albumista}}

# removeSelectedFromAlbumFailureNotification
source: Failed removing items from album
fi: Kohteiden poistaminen albumista epäonnistui

# addServerTooltip
source: Add server
fi: Lisää palvelin

# removeServerSuccessNotification
source: Removed {server} successfully
fi: Palvelin:{server} poistettu

# createAlbumTooltip
source: New album
fi: Uusi albumi

# createAlbumFailureNotification
source: Failed creating album
fi: Albumin luonti epäonnistui

# albumSize
source: {count, plural, =0{Empty} =1{1 item} other{{count} items}}
fi: {count, plural, =0{Empty} =1{1 kohde} other{{count} kohdetta}}

# albumArchiveLabel
source: Archive
fi: Arkistoi

source: Connecting to {server}
fi: Yhdistetään {server}

# nameInputHint
source: Name
fi: Nimi

# albumNameInputInvalidEmpty
source: Please enter the album name
fi: Lisää albumin nimi

# skipButtonLabel
source: SKIP
fi: OHITA

# confirmButtonLabel
source: CONFIRM
fi: VAHVISTA

# signInHeaderText
source: Sign in to Nextcloud server
fi: Kirjaudu Nextcloud-palvelimeen

# signIn2faHintText
source: Use an app password if you have two-factor authentication enabled in the server
fi: Käytä sovellussalasanaa, jos käytössäsi on kaksivaiheinen tunnistautuminen

# serverAddressInputHint
source: Server address
fi: Palvelimen osoite

# serverAddressInputInvalidEmpty
source: Please enter the server address
fi: Syötä palvelimen osoite

# usernameInputHint
source: Username
fi: Käyttäjätunnus

# usernameInputInvalidEmpty
source: Please enter your username
fi: Syötä käyttäjätunnus

# passwordInputHint
source: Password
fi: Salasana

# passwordInputInvalidEmpty
source: Please enter your password
fi: Syötä salasana

# rootPickerHeaderText
source: Pick the folders to be included
fi: Valitse sisällytetyt kansiot

# rootPickerSubHeaderText
source: Only photos inside the folders will be shown. Press Skip to include all
fi: Ainoastaan kansion sisäisest kuvat näytetään. Paina Ohita sisällyttääksesi kaikki kuvat

# rootPickerNavigateUpItemText
source: (go back)
fi: (takaisin)

# rootPickerUnpickFailureNotification
source: Failed unpicking item
fi: Kohteen valinta epäonnistui

# rootPickerListEmptyNotification
source: Please pick at least one folder or press skip to include all
fi: Valitse vähintään yksi kansio tai paina ohita sisällyttääksesi kaikki

# setupWidgetTitle
source: Getting started
fi: Aloitetaan

# setupSettingsModifyLaterHint
source: You can change this later in Settings
fi: Voit muuttaa tämän myöhemmin asetuksista

# setupHiddenPrefDirNoticeDetail
source: This app creates a folder on the Nextcloud server to store preference files. Please do not modify or remove it unless you plan to remove this app
fi: Tämä sovellus luo Nextcloud-palvelimeen kansion asetustiedostoja. Älä muokkaa tai poista kansiota ellet ole aikeissa poistaa sovellusta

# settingsWidgetTitle
source: Settings
fi: Asetukset

# settingsLanguageTitle
source: Language
fi: Kieli

# settingsLanguageOptionSystemDefaultLabel
source: System default
fi: Järjestelmän oletus

# settingsExifSupportTitle
source: EXIF support
fi: EXIF-tuki

# settingsExifSupportTrueSubtitle
source: Require extra network usage
fi: Vaatii ylimääräistä verkon käyttöä

# settingsExifWifiOnlyTitle
source: Process EXIF over Wi-Fi only
fi: Prosessoi tiedostoja vain kun WIFI-yhteys on käytettävissä

# settingsExifWifiOnlyFalseSubtitle
source: Data charges may apply
fi: Toimenpiteestä voi aiheutua data-maksuja

# settingsMemoriesTitle
source: Memories
fi: Muistot

# settingsMemoriesSubtitle
source: Show photos taken in the past
fi: Näytä aiemmin otettuja kuvia

# settingsAccountTitle
source: Account
fi: Tili

# settingsAccountLabelTitle
source: Label
fi: Otsikko

# settingsAccountLabelDescription
source: Set a label to be shown in place of the server URL
fi: Aseta tunniste, joka näytetään palvelimen URL:n sijasta

# settingsIncludedFoldersTitle
source: Included folders
fi: Sisällytetyt kansiot

# settingsShareFolderTitle
source: Share folder
fi: Jaa kansio

# settingsShareFolderDialogTitle
source: Locate the share folder
fi: Paikanna jaettu kansio

# settingsShareFolderDialogDescription
source: This setting corresponds to the share_folder parameter in config.php. The two values MUST be identical. Please locate the same folder as the one set in config.php.
fi: Tämä asetus vaikuttaa share_folder parametreihini config.php -tiedostossa. Asetusten arvojen TÄYTYY olla identtisiä. Paikanna sama kansio, joka on määritetty config-php -tiedostossa.

# settingsShareFolderPickerDescription
source: Please locate the same folder as the one set in config.php. Press default if you did not set the parameter.
fi: Paikanna sama kansio, joka on määritetty config.php -tiedostossa. Paina oletusta, jos et ole määrittänyt parametrejä käsin.

# settingsServerAppSectionTitle
source: Server app support
fi: Palvelimen sovellustuki

# settingsPhotosDescription
source: Customize contents shown in the Photos tab
fi: Muokkaa Kuvat-välilehdellä näytettävää sisältöä

# settingsMemoriesRangeTitle
source: Memories range
fi: Muistojen väli

# settingsMemoriesRangeValueText
source: {range, plural, =1{+-{range} day} other{+-{range} days}}
fi: {range, plural, =1{+-{range} päivä} other{+-{range} päivää}}

# settingsViewerTitle
source: Viewer
fi: Katselin

# settingsViewerDescription
source: Customize the image/video viewer
fi: Muokkaa kuva/video -katselinta

# settingsScreenBrightnessTitle
source: Screen brightness
fi: Näytön kirkkaus

# settingsScreenBrightnessDescription
source: Override system brightness level
fi: Ohita järjestelmän määrittämä kirkkaus

# settingsForceRotationTitle
source: Ignore rotation lock
fi: Ohita näytön kiertäjän lukitus

# settingsForceRotationDescription
source: Rotate the screen even when auto rotation is disabled
fi: Kierrä näyttöä, vaikka järjestelmän automaattinen näytönkierto on poiskytketty

# settingsMapProviderTitle
source: Map provider
fi: Karttapalvelun-tarjoaja

# settingsAlbumTitle
source: Album
fi: Albumi

# settingsAlbumDescription
source: Customize albums
fi: Muokkaa albumeita

# settingsShowDateInAlbumTitle
source: Group photos by date
fi: Ryhmitä kuvat päivämäärän mukaan

# settingsShowDateInAlbumDescription
source: Apply only when the album is sorted by time
fi: Käytä vain kun albumi on lajiteltu ajan mukaan

# settingsImageEditTitle
source: Editor
fi: Editori

# settingsImageEditDescription
source: Customize image enhancements and the image editor
fi: Muokkaa kuvien parannusta ja kuvaeditoria

# settingsEnhanceMaxResolutionTitle2
source: Image resolution for enhancements
fi: Kuvaresoluutio muokkausta varten

# settingsEnhanceMaxResolutionDescription
source: Photos larger than the selected resolution will be downscaled. High resolution photos require significantly more memory and time to process. Please lower this setting if the app crashed while enhancing your photos.
fi: Määritettyä resoluutiota suuremmat kuvat skaalataan määritettyyn resoluutioon. Korkean resoluution kuvien käsittely vie huomattavasti enemmän muistia ja aikaa. Mikäli sovellus kaatuu käsittelyn aikana, vähennä tämän asetuksen arvoa.

# settingsImageEditSaveResultsToServerTitle
source: Save results to server
fi: Tallenna muokkaus palvelimelle

# settingsImageEditSaveResultsToServerTrueDescription
source: Results are saved to server, fallback to device storage if failed
fi: Muokkaukset tallennetaan palvelimelle. Virheen sattuessa muokkaukset tallennetaan paikallisesti laitteelle.

# settingsImageEditSaveResultsToServerFalseDescription
source: Results are saved to this device
fi: Muokkaukset tallennetaan paikallisesti tälle laitteelle.

# settingsThemeTitle
source: Theme
fi: Teema

# settingsThemeDescription
source: Customize the appearance of the app
fi: Muokkaa sovelluksen ulkoasua

# settingsFollowSystemThemeTitle
source: Follow system theme
fi: Käytä järjestelmän teemaa

# settingsUseBlackInDarkThemeTitle
source: Darker theme
fi: Tumma teema

# settingsUseBlackInDarkThemeTrueDescription
source: Use black in dark theme
fi: Käytä mustaa tummassa teemassa

# settingsUseBlackInDarkThemeFalseDescription
source: Use dark grey in dark theme
fi: Käytä tumman harmaata tummassa teemassa

# settingsMiscellaneousTitle
source: Miscellaneous
fi: Sekalaiset

# settingsDoubleTapExitTitle
source: Double tap to exit
fi: Napauta kahdesti poistuaksesi

# settingsPhotosTabSortByNameTitle
source: Sort by filename in Photos
fi: Järjestä tiedostonimen mukaan

# settingsExperimentalTitle
source: Experimental
fi: Kokeellinen

# settingsExperimentalDescription
source: Features that are not ready for everyday use
fi: Kokeellisia ominaisuuksia, jotka eivät ole vielä täysin vakaita

# settingsAboutSectionTitle
source: About
fi: Tietoa

# settingsVersionTitle
source: Version
fi: Versio

# settingsSourceCodeTitle
source: Source code
fi: Lähdekoodi

# settingsBugReportTitle
source: Report issue
fi: Ilmoita ongelmasta

# settingsCaptureLogsTitle
source: Capture logs
fi: Kaappaa lokitiedot

# settingsCaptureLogsDescription
source: Help developer to diagnose bugs
fi: Auta kehittäjää korjaamaan bugeja

# settingsTranslatorTitle
source: Translator
fi: Kääntäjä

# writePreferenceFailureNotification
source: Failed setting preference
fi: Asetusten tallennus epäonnistui

# enableButtonLabel
source: ENABLE
fi: OTA KÄYTTÖÖN

# exifSupportDetails
source: Enabling EXIF support will make various metadata available like date taken, camera model, etc. In order to read these metadata, extra network usage is required to download the original full-sized image. The app will only start downloading when connected to a Wi-Fi network
fi: EXIF-tuen käyttöönotto tuo metadatasta lisätietoa kuten, kuvauspäivämäärä, kameramalli jne. Jotta sovellus voi lukea metadataa, käyttää se enemmän verkkoa täysikokoisten kuvien lataamista varten. Sovellus lataa ainoastaan Wi-Fi verkossa.

# exifSupportConfirmationDialogTitle
source: Enable EXIF support?
fi: Ota EXIF-tuki käyttöön

# captureLogDetails
source: To take logs for a bug report: 1. Enable this setting 2. Reproduce the issue 3. Disable this setting 4. Look for nc-photos.log in the download folder *If the issue causes the app to crash, no logs could be captured. In such case, please contact the developer for further instructions
fi: Lokitietojen tallenusta varten: 1. Ota tämä asetus käyttöön 2. Toista ongelma 3. Poista tämä asetus käytöstä 4. Etsi nc-photos.log -tiedosto latauskansiosta *Mikäli ongelma kaataa sovelluksen, lokitiedostoja ei pystytä tallentamaan. Tässä tapauksessa ota yhteyttä kehittäjään lisätietoja varten.

# captureLogSuccessNotification
source: Logs saved successfully
fi: Lokitiedot tallennettu onnistuneesti

# doneButtonLabel
source: DONE
fi: VALMIS

# nextButtonLabel
source: NEXT
fi: SEURAAVA

# connectButtonLabel
source: CONNECT
fi: YHDISTÄ

# rootPickerSkipConfirmationDialogContent2
source: All your files will be included. This may increase the memory usage and degrade performance
fi: Kaikki tiedostosi sisällytetään. Tämä voi lisä muistinkäyttöä ja hidastaa suorituskykyä.

# detailsTooltip
source: Details
fi: Tiedot

# downloadTooltip
source: Download
fi: Lataus

# downloadProcessingNotification
source: Downloading file
fi: Ladataan tiedostoa

# downloadSuccessNotification
source: Downloaded file successfully
fi: Tiedoston lataus onnistui

# downloadFailureNotification
source: Failed downloading file
fi: Tiedoston lataus epäonnistui

# nextTooltip
source: Next
fi: Seuraava

# previousTooltip
source: Previous
fi: Edellinen

# webSelectRangeNotification
source: Hold shift + click to select all in between
fi: Paina shift + napauta viimeistä kuvaa valitaksesi kuvat niiden välistä

# mobileSelectRangeNotification
source: Long press another item to select all in between
fi: Paina kohdetta pitkään valitaksesi kaikki niiden väliltä

# updateDateTimeDialogTitle
source: Modify date & time
fi: Muokkaa aikaa ja päiväystä

# dateSubtitle
source: Date
fi: Päivämäärä

# timeSubtitle
source: Time
fi: Aika

# dateYearInputHint
source: Year
fi: Vuosi

# dateMonthInputHint
source: Month
fi: Kuukausi

# dateDayInputHint
source: Day
fi: Päivä

# timeHourInputHint
source: Hour
fi: Tunti

# timeMinuteInputHint
source: Minute
fi: Minuutti

# timeSecondInputHint
source: Second
fi: Sekuntti

# dateTimeInputInvalid
source: Invalid value
fi: Epäkelpo arvo

# updateDateTimeFailureNotification
source: Failed modifying date & time
fi: Ajan ja päiväyksen muuttaminen epäonnistui

# albumDirPickerHeaderText
source: Pick the folders to be associated
fi: Valitse mukana olevat albumit

# albumDirPickerSubHeaderText
source: Only photos in the associated folders will be included in this album
fi: Ainoastaan valituissa kansioissa olevat kuvat näkyvät tässä albumissa

# albumDirPickerListEmptyNotification
source: Please pick at least one folder
fi: Valitse vähintään yksi albumi

# importFoldersTooltip
source: Import folders
fi: Tuo kansioita

# albumImporterHeaderText
source: Import folders as albums
fi: Tuo kansiot albumeiksi

# albumImporterSubHeaderText
source: Suggested folders are listed below. Depending on the number of files on your server, it might take a while to finish
fi: Suositellut albumit on listattu alapuolelle. Tiedostojen tuontinopeus riippuu tiedostojen määrästä palvelimella.

# importButtonLabel
source: IMPORT
fi: TUO

# editAlbumMenuLabel
source: Edit album
fi: Muokkaa albumia

# doneButtonTooltip
source: Done
fi: Valmis

# editAccountConflictFailureNotification
source: An account already exists with the same settings
fi: Käyttäjätunnus samoilla asetuksilla on jo olemassa

# genericProcessingDialogContent
source: Please wait
fi: Ole hyvä ja odota

# sortTooltip
source: Sort
fi: Lajittele

# sortOptionTimeAscendingLabel
source: Oldest first
fi: Vanhin ensin

# sortOptionTimeDescendingLabel
source: Newest first
fi: Uusin ensin

# sortOptionFilenameAscendingLabel
source: Filename
fi: Tiedostonimi

# sortOptionFilenameDescendingLabel
source: Filename (descending)
fi: Tiedostonimi (laskeutuva)

# sortOptionAlbumNameLabel
source: Album name
fi: Albumin nimi

# sortOptionAlbumNameDescendingLabel
source: Album name (descending)
fi: Albumin nimi (laskeva)

# sortOptionManualLabel
source: Manual
fi: Käsin

# albumEditDragRearrangeNotification
source: Long press and drag an item to rearrange it manually
fi: Paina kohdetta pitkään järjestääksesi sen uudelleen käsin

# albumAddTextTooltip
source: Add text
fi: Lisää teksti

# shareTooltip
source: Share
fi: Jaa

# shareSelectedEmptyNotification
source: Select some photos to share
fi: Valitse kuvia jaettavaksi

# shareDownloadingDialogContent
source: Downloading
fi: Ladataan

# searchTooltip
source: Search
fi: Etsi

# listNoResultsText
source: No results
fi: Ei tuloksia

# listEmptyText
source: Empty
fi: Tyhjä

# albumTrashLabel
source: Trash
fi: Roskakori

# restoreTooltip
source: Restore
fi: Palauta

# restoreSelectedProcessingNotification
source: {count, plural, =1{Restoring 1 item} other{Restoring {count} items}}
fi: {count, plural, =1{Palautetaan 1 kohde} other{Palautetaan {count} kohdetta}}

# restoreSelectedSuccessNotification
source: All items restored successfully
fi: Kaikki kohteet palautettu onnistuneesti

# restoreSelectedFailureNotification
source: {count, plural, =1{Failed restoring 1 item} other{Failed restoring {count} items}}
fi: {count, plural, =1{1 kohteen palautus epäonnistui} other{{count} kohteen palautus epäonnistui}}

# restoreProcessingNotification
source: Restoring item
fi: Palautetaan kohdetta

# restoreSuccessNotification
source: Restored item successfully
fi: Kohde palautettu onnistuneesti

# restoreFailureNotification
source: Failed restoring item
fi: Kohteen palautus epäonnistui

# deletePermanentlyTooltip
source: Delete permanently
fi: Poista lopullisesti

# deletePermanentlyConfirmationDialogTitle
source: Delete permanently
fi: Poista lopullisesti

# deletePermanentlyConfirmationDialogContent
source: Selected items will be deleted permanently from the server. This action is nonreversible
fi: Valitut kohteet poistetaan palvelimelta lopullisesti. Tätä toimintoa ei voi perua

# albumSharedLabel
source: Shared
fi: Jaetut

# setAlbumCoverProcessingNotification
source: Setting photo as album cover
fi: Aseta kuva albumin kansikuvaksi

# setAlbumCoverSuccessNotification
source: Set album cover successfully
fi: Kansikuva asetetttu onnistuneesti

# setAlbumCoverFailureNotification
source: Failed setting album cover
fi: Kansikuvan asetus epäonistui

# metadataTaskProcessingNotification
source: Processing image metadata in background
fi: Prosessoidaan kuvien metadataa taustalla

# metadataTaskPauseNoWiFiNotification
source: Waiting for WiFi
fi: Odotetaan WiFi:ä

# configButtonLabel
source: CONFIG
fi: ASETUS

# helpTooltip
source: Help
fi: Tuki

# helpButtonLabel
source: HELP
fi: TUKI

# removeFromAlbumTooltip
source: Remove from album
fi: Poista albumista

# changelogTitle
source: Changelog
fi: Muutosloki

# serverCertErrorDialogTitle
source: Server certificate cannot be trusted
fi: Palvelisertifikaattiin ei voida luottaa

# serverCertErrorDialogContent
source: The server may be hacked or someone is trying to steal your information
fi: Palvelimeen on mahdollisesti murtauduttu tai joku yrittää mahdollisesti varastaa tietojasi

# advancedButtonLabel
source: ADVANCED
fi: EDISTYNEET

# whitelistCertDialogTitle
source: Whitelist unknown certificate?
fi: Salli tuntematon sertifikaatti?

# whitelistCertDialogContent
source: You can whitelist the certificate to make the app accept it. WARNING: This poses a great security risk. Make sure the cert is self-signed by you or a trusted party Host: {host} Fingerprint: {fingerprint}
fi: Voit sallia sertifikaatin ja saada sovelluksen hyväksymään sen. VAROITUS: Tämä on tietoturvariski! Varmista, että sertifikaatin on luonut sinä itse tai luotettava taho Host: {host} Sormenjälki: {fingerprint}

# whitelistCertButtonLabel
source: ACCEPT THE RISK AND WHITELIST
fi: HYVÄKSY RISKIT JA SALLI

# fileSharedByDescription
source: Shared with you by this user
fi: Jaettu sinulle tältä käyttäjältä

# emptyTrashbinTooltip
source: Empty trash
fi: Tyhjä roskakori

# emptyTrashbinConfirmationDialogTitle
source: Empty trash
fi: Tyhjä roskakori

# emptyTrashbinConfirmationDialogContent
source: All items will be deleted permanently from the server. This action is nonreversible
fi: Kaikki kohteet poistetaan lopullisesti palvelimelta Tätä ei voi peruuttaa

# unsetAlbumCoverTooltip
source: Unset cover
fi: Poista albumin kansi

# unsetAlbumCoverProcessingNotification
source: Unsetting cover
fi: Poistetaan albumin kantta

# unsetAlbumCoverSuccessNotification
source: Unset cover successfully
fi: Albumin kannen poisto onnistui

# unsetAlbumCoverFailureNotification
source: Failed unsetting cover
fi: Albumin kannen poisto epäonnistui

# muteTooltip
source: Mute
fi: Mykistä

# unmuteTooltip
source: Unmute
fi: Poista mykistys

# collectionPeopleLabel
source: People
fi: Ihmiset

# personPhotoCountText
source: {count, plural, =1{1 photo} other{{count} photos}}
fi: {count, plural, =1{1 kuva} other{{count} kuvat}}

# slideshowTooltip
source: Slideshow
fi: Kuvasarja

# slideshowSetupDialogTitle
source: Setup slideshow
fi: Aseta kuvasarja

# slideshowSetupDialogDurationTitle
source: Image duration (MM:SS)
fi: Kuvan kesto (MM:SS)

# slideshowSetupDialogShuffleTitle
source: Shuffle
fi: Sekoita

# slideshowSetupDialogRepeatTitle
source: Repeat
fi: Toista

# slideshowSetupDialogReverseTitle
source: Reverse
fi: Käänteinen

# linkCopiedNotification
source: Link copied
fi: Linkki kopioitu

# shareMethodDialogTitle
source: Share as
fi: Jaa

# shareMethodPreviewTitle
source: Preview
fi: Esikatselu

# shareMethodPreviewDescription
source: Share a reduced quality preview to other apps (only support images)
fi: Jaa heikkolaatuisempi esikatselu muihin sovelluksiin (vain kuvat tuettu)

# shareMethodOriginalFileTitle
source: Original file
fi: Alkuperäinen tiedosto

# shareMethodOriginalFileDescription
source: Download the original file and share it to other apps
fi: Lataa alkuperäinen tiedosto ja jaa se muiden sovellusten kanssa

# shareMethodPublicLinkTitle
source: Public link
fi: Julkinen linkki

# shareMethodPublicLinkDescription
source: Create a new public link on the server. Anyone with the link can access the file
fi: Luo julkinen linkki palvelimelle. Kaikki linkinhaltijat voivat käyttää tiedostoa

# shareMethodPasswordLinkDescription
source: Create a new password protected link on the server
fi: Luo uusi salasanasuojattu linkki palvelimelle

# collectionSharingLabel
source: Sharing
fi: Jaettu
